of40/tutorials/rheoInterFoam/fluidConveyor/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    inletSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   walls;
        }
    }

    {
        name    inletSet;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (0.12 0.1 -999) (0.25 999 999);
        }
    }
);

// ************************************************************************* //
